{
  "courses": [
    {
      "id": 1,
      "title": "Digital Marketing Mastery",
      "price": 49.99,
      "shortDescription": "Learn the essentials of digital marketing and boost your online presence.",
      "longDescription": "In this comprehensive digital marketing course, you'll master the skills needed to succeed in the digital landscape. From social media marketing to search engine optimization, this course covers it all.",
      "image": "Digital Marketing.jpeg",
      "reviews": [
        {
          "user": "Alice",
          "comment": "Excellent course! Highly recommended."
        },
        {
          "user": "Bob",
          "comment": "Great content and practical insights."
        }
      ]
    },
    {
      "id": 2,
      "title": "Hydroponics Fundamentals",
      "price": 59.99,
      "shortDescription": "Discover the art and science of growing plants without soil.",
      "longDescription": "Explore the fascinating world of hydroponics and learn the principles behind soil-less plant cultivation. From nutrient solutions to advanced hydroponic systems, this course guides you through it all.",
      "image": "hydroponics.jpeg",
      "reviews": [
        {
          "user": "Eva",
          "comment": "Amazing course! I've successfully set up my hydroponic garden."
        },
        {
          "user": "Charlie",
          "comment": "Very informative. Loved the practical demonstrations."
        }
      ]
    },
    {
      "id": 3,
      "title": "Quantum Mechanics Unleashed",
      "price": 79.99,
      "shortDescription": "Delve into the mysterious world of quantum mechanics and its mind-bending concepts.",
      "longDescription": "Embark on a journey through the principles of quantum mechanics, from wave-particle duality to quantum entanglement. This course is designed to make complex concepts accessible and engaging.",
      "image": "quantum mechanics.jpeg",
      "reviews": [
        {
          "user": "Grace",
          "comment": "Mind-blowing! I never thought quantum mechanics could be this interesting."
        },
        {
          "user": "David",
          "comment": "The instructor's explanations are clear, making difficult concepts easy to understand."
        }
      ]
    },
    {
      "id": 4,
      "title": "Artificial Intelligence for Beginners",
      "price": 69.99,
      "shortDescription": "Unlock the basics of AI and understand its applications in the real world.",
      "longDescription": "Dive into the fundamentals of artificial intelligence, machine learning, and neural networks. This course provides a solid foundation for beginners interested in AI technologies.",
      "image": "ai.jpeg",
      "reviews": [
        {
          "user": "Frank",
          "comment": "Great introduction to AI. Clear and concise."
        },
        {
          "user": "Sophia",
          "comment": "The hands-on exercises were incredibly helpful."
        }
      ]
    },
    {
      "id": 5,
      "title": "Culinary Arts Masterclass",
      "price": 89.99,
      "shortDescription": "Explore the world of culinary arts and elevate your cooking skills.",
      "longDescription": "Join this masterclass to learn advanced culinary techniques, flavor pairings, and presentation skills. Whether you're a beginner or an experienced cook, this course has something for everyone.",
      "image": "culinary.jpeg",
      "reviews": [
        {
          "user": "Isabella",
          "comment": "Fantastic course! My cooking has improved significantly."
        },
        {
          "user": "Alex",
          "comment": "The chef's tips are invaluable. Highly recommended."
        }
      ]
    },
    {
      "id": 6,
      "title": "Financial Literacy for Millennials",
      "price": 59.99,
      "shortDescription": "Empower yourself with essential financial knowledge for the modern age.",
      "longDescription": "Take control of your finances with this comprehensive course. Learn about budgeting, investing, and financial planning tailored to the unique challenges faced by millennials.",
      "image": "literacy.jpeg",
      "reviews": [
        {
          "user": "Ryan",
          "comment": "This course is a game-changer for managing finances."
        },
        {
          "user": "Mia",
          "comment": "Practical advice that every millennial should follow."
        }
      ]
    },
    {
      "id": 7,
      "title": "Astrophysics Explained",
      "price": 79.99,
      "shortDescription": "Embark on a cosmic journey and unravel the mysteries of the universe.",
      "longDescription": "Explore the wonders of astrophysics, from the formation of stars to the structure of galaxies. This course provides a deep understanding of our place in the cosmos.",
      "image": "astrophysics.jpeg",
      "reviews": [
        {
          "user": "Sam",
          "comment": "Fascinating course! I'm hooked on astrophysics now."
        },
        {
          "user": "Olivia",
          "comment": "The visuals and explanations make complex topics easy to grasp."
        }
      ]
    },
    {
      "id": 8,
      "title": "Photography for Beginners",
      "price": 49.99,
      "shortDescription": "Unleash your creativity with the basics of photography.",
      "longDescription": "Learn the essentials of photography, from understanding your camera to capturing stunning compositions. This course is perfect for beginners with a passion for visual storytelling.",
      "image": "photography.jpeg",
      "reviews": [
        {
          "user": "Jack",
          "comment": "Great course for beginners. Practical tips for better photos."
        },
        {
          "user": "Emma",
          "comment": "I never thought I could take such amazing photos. Thanks, instructor!"
        }
      ]
    },
    {
      "id": 9,
      "title": "Environmental Sustainability in Business",
      "price": 69.99,
      "shortDescription": "Explore sustainable practices and their impact on modern businesses.",
      "longDescription": "Discover how businesses can contribute to environmental sustainability. This course covers eco-friendly practices, corporate responsibility, and green business strategies.",
      "image": "sustainability.jpeg",
      "reviews": [
        {
          "user": "Leo",
          "comment": "Eye-opening course! Every business should prioritize sustainability."
        },
        {
          "user": "Sophie",
          "comment": "Practical insights for implementing sustainability in any industry."
        }
      ]
    },
    {
      "id": 10,
      "title": "Mindfulness Meditation for Stress Relief",
      "price": 39.99,
      "shortDescription": "Calm your mind and reduce stress with mindfulness meditation techniques.",
      "longDescription": "Learn the art of mindfulness meditation to find inner peace and reduce stress in your daily life. This course provides practical exercises and guidance for beginners.",
      "image": "meditation.jpeg",
      "reviews": [
        {
          "user": "Liam",
          "comment": "Life-changing! I feel more relaxed and focused."
        },
        {
          "user": "Ava",
          "comment": "Highly recommend for anyone dealing with stress or anxiety."
        }
      ]
    }
  ],
  "users": [
    {
      "id": 1,
      "username": "user1",
      "password": "pass1"
    },
    {
      "id": 2,
      "username": "user2",
      "password": "pass2"
    },
    {
      "id": 3,
      "username": "user3",
      "password": "pass3"
    },
    {
      "id": 4,
      "username": "user4",
      "password": "pass4"
    },
    {
      "id": 5,
      "username": "user5",
      "password": "pass5"
    },
    {
      "username": "emmanuel",
      "password": "11223344",
      "id": 6
    },
    {
      "username": "Jabali",
      "password": "Jabali12*",
      "id": 7
    }
  ]
}
